HELYXcore-4.4.0/examples/legacy/multiphase/interDyMFoam/RAS/DTCHull/constant/dynamicMeshDict.sixDoF
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            motionSolver;
    libs            ( "libfvMeshMovers.so" "libsixDoFRigidBodyMotion.so" );
    motionSolver    sixDoFRigidBodyMotion;

    patches         (hull);
    innerDistance   0.3;
    outerDistance   1;

    centreOfMass    (2.929541 0 0.2);
    mass            412.73;
    momentOfInertia (40 921 921);
    rhoInf          1;
    report          on;

    value           uniform (0 0 0);

    accelerationRelaxation 0.4;

    solver
    {
        type Newmark;
    }

    constraints
    {
        zAxis
        {
            sixDoFRigidBodyMotionConstraint line;
            direction     (0 0 1);
        }
        yPlane
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis          (0 1 0);
        }
    }

    restraints
    {
        translationDamper
        {
            sixDoFRigidBodyMotionRestraint linearDamper;
            coeff         8596;
        }
        rotationDamper
        {
            sixDoFRigidBodyMotionRestraint sphericalAngularDamper;
            coeff         11586;
        }
    }
}


// ************************************************************************* //
